/*Введение в AJAX и COMET

Что такое AJAX?
AJAX (аббревиатура от «Asynchronous Javascript And Xml») – технология обращения 
к серверу без перезагрузки страницы.
Под AJAX подразумевают любое общение с сервером без перезагрузки страницы, организованное при помощи JavaScript.

Что я могу сделать с помощью AJAX?
	Элементы интерфейса
В первую очередь AJAX полезен для форм и кнопок, связанных с элементарными действиями: добавить в корзину, подписаться, и т.п.
Сейчас – в порядке вещей, что такие действия на сайтах осуществляются без перезагрузки страницы.
	Динамическая подгрузка данных
Например, дерево, которое при раскрытии узла запрашивает данные у сервера.
	Живой поиск
Живой поиск – классический пример использования AJAX, взятый на вооружение современными поисковыми системами.

Технически, с помощью AJAX можно обмениваться любыми данными с сервером.

Обычно используются форматы:
	JSON – для отправки и получения структурированных данных, объектов.
	XML – если сервер почему-то работает в формате XML, то можно использовать и его, есть средства.
	HTML/текст – можно и просто загрузить с сервера код HTML или текст для показа на странице.
	Бинарные данные, файлы – гораздо реже, в современных браузерах есть удобные средства для них.*/
	
/*Что такое COMET?
COMET – общий термин, описывающий различные техники получения данных по инициативе сервера.
Можно сказать, что AJAX – это «отправил запрос – получил результат», а COMET – это «непрерывный канал, по которому приходят данные».

Примеры COMET-приложений:
	Чат – человек сидит и смотрит, что пишут другие. При этом новые сообщения приходят «сами по себе», он не должен нажимать на кнопку для обновления окна чата.
	Аукцион – человек смотрит на экран и видит, как обновляется текущая ставка за товар.
	Интерфейс редактирования – когда один редактор начинает изменять документ, другие видят информацию об этом. Возможно и совместное редактирование, когда редакторы видят изменения друг друга.*/
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	