/*Фокусировка: focus/blur
Говорят, что элемент «получает фокус», когда посетитель фокусируется на нём. Обычно фокусировка
автоматически происходит при нажатии на элементе мышкой, но также можно перейти на нужный элемент 
клавиатурой – через клавишу Tab, нажатие пальцем на планшете и так далее.
Момент получения фокуса и потери очень важен.
При получении фокуса мы можем подгрузить данные для автодополнения, начать отслеживать изменения. 
При потере – проверить данные, которые ввёл посетитель.

Кроме того, иногда полезно «вручную», из JavaScript перевести фокус на нужный элемент, 
например, на поле в динамически созданной форме.*/


/*События focus/blur
Событие focus вызывается тогда, когда пользователь фокусируется на элементе,
а blur – когда фокус исчезает, например посетитель кликает на другом месте экрана.*/



























































